/*
  24 state EKF based on the derivation in https://github.com/priseborough/
  InertialNav/blob/master/derivations/RotationVectorAttitudeParameterisation/
  GenerateNavFilterEquations.m

  Converted from Matlab to C++ by Paul Riseborough

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#pragma once
#pragma GCC optimize("O2")

#include <inttypes.h>
#include <stdbool.h>
#include "ekf/ekf.h"
#include "sensors/acceleration.h"
#include "sensors/gyro.h"
#include "sensors/barometer.h"
#include "sensors/compass.h"
#include "sensors/pitotmeter.h"
#include "sensors/rangefinder.h"
#include "common/maths.h"
#include "fc/runtime_config.h"
#include "io/gps_private.h"
#include "navigation/navigation.h"
#include "navigation/navigation_private.h"
#include "navigation/navigation_pos_estimator_private.h"
#include "scheduler/scheduler.h"

#define SOLVE_AFTER

// GPS pre-flight check bit locations
#define MASK_GPS_NSATS (1 << 0)
#define MASK_GPS_HDOP (1 << 1)
#define MASK_GPS_SPD_ERR (1 << 2)
#define MASK_GPS_POS_ERR (1 << 3)
#define MASK_GPS_YAW_ERR (1 << 4)
#define MASK_GPS_POS_DRIFT (1 << 5)
#define MASK_GPS_VERT_SPD (1 << 6)
#define MASK_GPS_HORIZ_SPD (1 << 7)

// active height source
#define HGT_SOURCE_BARO 0
#define HGT_SOURCE_RNG 1
#define HGT_SOURCE_GPS 2

// target EKF update time step
#define EKF_TARGET_DT 0.01f

// mag fusion final reset altitude
#define EKF_MAG_FINAL_RESET_ALT 2.5f

// maximum number of yaw resets due to detected magnetic anomaly allowed per flight
#define MAG_ANOMALY_RESET_MAX 2

// number of seconds a request to reset the yaw to the GSF estimate is active before it times out
#define YAW_RESET_TO_GSF_TIMEOUT_MS 5000

// limit on horizontal position states
#define EKF_POSXY_STATE_LIMIT 1.0e6

// Possible values for _flowUse
#define FLOW_USE_NONE 0
#define FLOW_USE_NAV 1
#define FLOW_USE_TERRAIN 2

#define COMPASS_MAX_XYZ_ANG_DIFF DEGREES_TO_RADIANS(90.0f)
#define COMPASS_MAX_XY_ANG_DIFF DEGREES_TO_RADIANS(60.0f)
#define COMPASS_MAX_XY_LENGTH_DIFF 200.0f

typedef float Vector2[2];
typedef float Vector3[3];
typedef float Vector5[5];
typedef float Vector6[6];
typedef float Vector8[8];
typedef float Vector9[9];
typedef float Vector10[10];
typedef float Vector14[14];
typedef float Vector23[23];
typedef float Vector24[24];
typedef float Vector25[25];
typedef float Vector28[28];
typedef float Matrix24[24][24];

typedef union
{
    struct
    {
        bool attitude : 1;           // 0 - true if attitude estimate is valid
        bool horiz_vel : 1;          // 1 - true if horizontal velocity estimate is valid
        bool vert_vel : 1;           // 2 - true if the vertical velocity estimate is valid
        bool horiz_pos_rel : 1;      // 3 - true if the relative horizontal position estimate is valid
        bool horiz_pos_abs : 1;      // 4 - true if the absolute horizontal position estimate is valid
        bool vert_pos : 1;           // 5 - true if the vertical position estimate is valid
        bool terrain_alt : 1;        // 6 - true if the terrain height estimate is valid
        bool const_pos_mode : 1;     // 7 - true if we are in const position mode
        bool pred_horiz_pos_rel : 1; // 8 - true if filter expects it can produce a good relative horizontal position estimate - used before takeoff
        bool pred_horiz_pos_abs : 1; // 9 - true if filter expects it can produce a good absolute horizontal position estimate - used before takeoff
        bool takeoff_detected : 1;   // 10 - true if optical flow takeoff has been detected
        bool takeoff : 1;            // 11 - true if filter is compensating for baro errors during takeoff
        bool touchdown : 1;          // 12 - true if filter is compensating for baro errors during touchdown
        bool using_gps : 1;          // 13 - true if we are using GPS position
        bool gps_glitching : 1;      // 14 - true if GPS glitching is affecting navigation accuracy
        bool gps_quality_good : 1;   // 15 - true if we can use GPS for navigation
        bool initalized : 1;         // 16 - true if the EKF has ever been healthy
        bool rejecting_airspeed : 1; // 17 - true if we are rejecting airspeed data
        bool dead_reckoning : 1;     // 18 - true if we are dead reckoning (e.g. no position or velocity source)
    } flags;
    uint32_t value;
} nav_filter_status_t;

// variables used to calculate a vertical velocity that is kinematically consistent with the verical position
typedef struct
{
    float pos;
    float vel;
    float acc;
} vertCompFiltState_t;

// flags indicating severe numerical errors in innovation variance calculation for different fusion operations
typedef struct
{
    bool bad_xmag : 1;
    bool bad_ymag : 1;
    bool bad_zmag : 1;
    bool bad_airspeed : 1;
    bool bad_sideslip : 1;
    bool bad_nvel : 1;
    bool bad_evel : 1;
    bool bad_dvel : 1;
    bool bad_npos : 1;
    bool bad_epos : 1;
    bool bad_dpos : 1;
    bool bad_yaw : 1;
    bool bad_decl : 1;
    bool bad_xflow : 1;
    bool bad_yflow : 1;
    bool bad_rngbcn : 1;
} faultStatus_t;

// states held by magnetomter fusion across time steps
// magnetometer X,Y,Z measurements are fused across three time steps
// to level computational load as this is an expensive operation
typedef struct
{
    float q0;
    float q1;
    float q2;
    float q3;
    float magN;
    float magE;
    float magD;
    float magXbias;
    float magYbias;
    float magZbias;
    fpMat3_t DCM;
    fpVector3_t MagPred;
    float R_MAG;
    Vector9 SH_MAG;
} mag_state_t;

typedef struct
{
    fpVector3_t angErr;         // 0..2
    fpVector3_t velocity;       // 3..5
    fpVector3_t position;       // 6..8
    fpVector3_t gyro_bias;      // 9..11
    fpVector3_t gyro_scale;     // 12..14
    float accel_zbias;          // 15
    fpVector3_t earth_magfield; // 16..18
    fpVector3_t body_magfield;  // 19..21
    fpVector2_t wind_vel;       // 22..23
    fpQuaternion_t quat;        // 24..27
} state_elements_t;

typedef union
{
    Vector28 statesArray;
    state_elements_t stateStruct;
} ekfStates_U;

typedef struct
{
    fpQuaternion_t quat;  // 0..3
    fpVector3_t velocity; // 4..6
    fpVector3_t position; // 7..9
} output_elements_t;

typedef struct
{
    fpVector3_t delAng; // 0..2
    fpVector3_t delVel; // 3..5
    float delAngDT;     // 6
    float delVelDT;     // 7
    uint32_t time_ms;   // 8
} imu_elements_t;

typedef struct
{
    uint8_t elsize;
    union
    {
        imu_elements_t *imu_buffer;
        output_elements_t *output_buffer;
    } buffer;
    uint8_t size;
    uint8_t oldest;
    uint8_t youngest;
    bool filled;
} ekf_imu_buffer;

typedef struct
{
    // measurement timestamp (msec)
    uint32_t time_ms;
} EKF_obs_element_t;

typedef struct
