/*
 * This file is part of INAV.
 *
 * INAV is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * INAV is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with INAV.  If not, see <http://www.gnu.org/licenses/>.
 */

// Extended Kalman Filter ported from ArduPilot to INAV by Julio Cesar Matias
// EKF based on https://github.com/priseborough/InertialNav

#include "navigation/ekf.h"

#include "build/debug.h"
#include "common/matrix.h"
#include "config/parameter_group.h"
#include "config/parameter_group_ids.h"
#include "drivers/time.h"
#include "fc/config.h"
#include "fc/runtime_config.h"
#include "fc/settings.h"
#include "flight/imu.h"
#include "io/gps.h"
#include "io/gps_private.h"
#include "navigation/navigation.h"
#include "navigation/navigation_pos_estimator_private.h"
#include "platform.h"
#include "scheduler/scheduler.h"
#include "sensors/acceleration.h"
#include "sensors/barometer.h"
#include "sensors/compass.h"
#include "sensors/gyro.h"
#include "sensors/pitotmeter.h"

typedef struct
{
    fpQuaternion_t quat;        // 0, 1, 2, 3
    fpVector3_t velocity;       // 4, 5, 6
    fpVector3_t position;       // 7, 8, 9
    fpVector3_t gyro_bias;      // 10, 11, 12
    float accel_zbias1;         // 13
    fpVector2_t wind_vel;       // 14, 15
    fpVector3_t earth_magfield; // 16, 17, 18
    fpVector3_t body_magfield;  // 19, 20, 21
    float accel_zbias2;         // 22
    fpVector3_t vel1;           // 23, 24, 25
    float posD1;                // 26
    fpVector3_t vel2;           // 27, 28, 29
    float posD2;                // 30
} state_elements_t;

typedef union
{
    Vector31 statesArray;
    state_elements_t stateStruct;
} ekfStates_U;

// states held by magnetomter fusion across time steps
// magnetometer X,Y,Z measurements are fused across three time steps
// to level computational load as this is an expensive operation
typedef struct
{
    float q0;
    float q1;
    float q2;
    float q3;
    float magN;
    float magE;
    float magD;
    float magXbias;
    float magYbias;
    float magZbias;
    uint8_t obsIndex;
    fpMatrix3_t DCM;
    fpVector3_t MagPred;
    float R_MAG;
    float SH_MAG[9];
} mag_state_t;

typedef struct
{
    bool bad_xmag : 1;
    bool bad_ymag : 1;
    bool bad_zmag : 1;
    bool bad_airspeed : 1;
    bool bad_sideslip : 1;
} fault_status_t;

PG_REGISTER_WITH_RESET_TEMPLATE(ekfConfig_t, ekfConfig, PG_EKF_CONFIG, 0);

PG_RESET_TEMPLATE(ekfConfig_t, ekfConfig,
                  .ekfEnabled = SETTING_EKF_ENABLED_DEFAULT, );

